announcements/now-thirty.org
* Introduction

  1. Emacspeak, started in September 1994, was released as Open
   Source in [[https://tvraman.github.io/emacspeak//web/releases/release-3.0.html][April 1995]].
  2. [[https://emacspeak.sourceforge.net/turning-twenty.html][Emacspeak At Twenty]]  was published in September 2014 to trace the
     evolution of the project.
  3. Now, this article gives a birds-eye overview of the last 10 years
     by following the logical structure of the Turning-Twenty paper.
  4. In the process, we identify the dreams that have come to pass as
     well as the expectations that have failed to  materialize because
     of developments in the larger  Internet eco-system we live in.
  5. But never fear, though some of the above might be superficially
     disappointing, they likely herald the nature of bigger and better
     things to come.
  6. As a proof-point, in 1994, I could not have imagined the impact
     that the world of Internet-centric computing and the accompanying
     information revolution has had on the state of information
     access.
  7. Share And Enjoy --- [[https://tvraman.github.io/emacspeak/web/01-gemini.ogg ][The Best Is Yet To Come]]!


** How To Read This Document

*  Using UNIX With Speech Output —  1994
* Key Enabler — Emacs And Lisp Advice
* Key Component —  Text To Speech (TTS)
* Emacspeak And Software Development 
* Emacspeak And Authoring Documents 
* Emacspeak And The Early Days Of The Web
* Audio Formatting —  Generalizing Aural CSS 
* Conversational Gestures For The Audio Desktop 
* Accessing Media Streams 
* EBooks—   Ubiquitous Access To Books 
* Leveraging Computational Tools —  From SQL And R To IPython Notebooks 
* Social Web  — EMail, Instant Messaging, Blogging  And Tweeting Using Open Protocols 
* The RESTful Web —  Web Wizards And URL Templates For Faster Access
* Mashing It Up —  Leveraging Evolving Web APIs
* Conclusion 
* References 

#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil expand-links:t f:t
#+options: inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:nil todo:t |:t
#+title: 30 Years On: Emacspeak --- A Speech Odyssey
#+date: <2024-07-10 Wed>
#+author: T.V Raman
#+email: raman@google.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 31.0.50 (Org mode 9.7.6)
#+cite_export:
