announcements/now-thirty.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-11 Thu 09:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>30 Years On: Emacspeak &#x2014; A Speech Odyssey</title>
<meta name="author" content="T.V Raman" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">30 Years On: Emacspeak &#x2014; A Speech Odyssey</h1>
<div id="outline-container-orgda96abe" class="outline-2">
<h2 id="orgda96abe"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Emacspeak, started in September 1994, was released as Open
Source in <a href="https://tvraman.github.io/emacspeak//web/releases/release-3.0.html">April 1995</a>.</li>
<li><a href="https://emacspeak.sourceforge.net/turning-twenty.html">Emacspeak At Twenty</a>  was published in September 2014 to trace the
evolution of the project.</li>
<li>Now, this article gives a birds-eye overview of the last 10 years
by following the logical structure of the Turning-Twenty paper.</li>
<li>In the process, we identify the dreams that have come to pass as
well as the expectations that have failed to  materialize because
of developments in the larger  Internet eco-system we live in.</li>
<li>But never fear, though some of the above might be superficially
disappointing, they likely herald the nature of bigger and better
things to come.</li>
<li>As a proof-point, in 1994, I could not have imagined the impact
that the world of Internet-centric computing and the accompanying
information revolution has had on the state of information
access.</li>
<li>Share And Enjoy &#x2014; <a href="https://tvraman.github.io/emacspeak/web/01-gemini.ogg%20">The Best Is Yet To Come</a>!</li>
</ol>
</div>
<div id="outline-container-org043363a" class="outline-3">
<h3 id="org043363a"><span class="section-number-3">1.1.</span> How To Read This Document</h3>
</div>
</div>
<div id="outline-container-orge20c2ec" class="outline-2">
<h2 id="orge20c2ec"><span class="section-number-2">2.</span> Using UNIX With Speech Output —  1994</h2>
</div>
<div id="outline-container-orgf578e1f" class="outline-2">
<h2 id="orgf578e1f"><span class="section-number-2">3.</span> Key Enabler — Emacs And Lisp Advice</h2>
</div>
<div id="outline-container-org5cfdbf3" class="outline-2">
<h2 id="org5cfdbf3"><span class="section-number-2">4.</span> Key Component —  Text To Speech (TTS)</h2>
</div>
<div id="outline-container-org49a3a0e" class="outline-2">
<h2 id="org49a3a0e"><span class="section-number-2">5.</span> Emacspeak And Software Development</h2>
</div>
<div id="outline-container-org2f045b4" class="outline-2">
<h2 id="org2f045b4"><span class="section-number-2">6.</span> Emacspeak And Authoring Documents</h2>
</div>
<div id="outline-container-orgdc3f40e" class="outline-2">
<h2 id="orgdc3f40e"><span class="section-number-2">7.</span> Emacspeak And The Early Days Of The Web</h2>
</div>
<div id="outline-container-org9c85270" class="outline-2">
<h2 id="org9c85270"><span class="section-number-2">8.</span> Audio Formatting —  Generalizing Aural CSS</h2>
</div>
<div id="outline-container-org96588bf" class="outline-2">
<h2 id="org96588bf"><span class="section-number-2">9.</span> Conversational Gestures For The Audio Desktop</h2>
</div>
<div id="outline-container-org7ed5457" class="outline-2">
<h2 id="org7ed5457"><span class="section-number-2">10.</span> Accessing Media Streams</h2>
</div>
<div id="outline-container-org23ceb28" class="outline-2">
<h2 id="org23ceb28"><span class="section-number-2">11.</span> EBooks—   Ubiquitous Access To Books</h2>
</div>
<div id="outline-container-org4c8d943" class="outline-2">
<h2 id="org4c8d943"><span class="section-number-2">12.</span> Leveraging Computational Tools —  From SQL And R To IPython Notebooks</h2>
</div>
<div id="outline-container-org5796f4a" class="outline-2">
<h2 id="org5796f4a"><span class="section-number-2">13.</span> Social Web  — EMail, Instant Messaging, Blogging  And Tweeting Using Open Protocols</h2>
</div>
<div id="outline-container-org9ad5dd3" class="outline-2">
<h2 id="org9ad5dd3"><span class="section-number-2">14.</span> The RESTful Web —  Web Wizards And URL Templates For Faster Access</h2>
</div>
<div id="outline-container-org444bd45" class="outline-2">
<h2 id="org444bd45"><span class="section-number-2">15.</span> Mashing It Up —  Leveraging Evolving Web APIs</h2>
</div>
<div id="outline-container-org89539a7" class="outline-2">
<h2 id="org89539a7"><span class="section-number-2">16.</span> Conclusion</h2>
</div>
<div id="outline-container-orgb1364b9" class="outline-2">
<h2 id="orgb1364b9"><span class="section-number-2">17.</span> References</h2>
<div class="outline-text-2" id="text-17">
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-07-10 Wed 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2024-07-11 Thu 09:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
